perf/async.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node_replicated:
      target: 'http://localhost:5555/many'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: pause
      pause: 10
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    - name: pause
      pause: 10
    

scenarios:
  - name: sync
    flow:
      - get:
          url: '/sync'