perf/work.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    many:
      target: 'http://localhost:5555/many'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain-Intensive
      duration: 120
      arrivalRate: 30
    - name: Plain-Quite
      duration: 30
      arrivalRate: 5

scenarios:
  - name: work
    flow:
      - get:
          url: '/work'